---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.SlopeEndHeight
source: html/6d6041ad-dc4e-0d03-8e7d-4ae92184e3bf.htm
---
# Autodesk.Revit.DB.ParameterTypeId.SlopeEndHeight Property

"Height Offset at Head"

## Syntax (C#)
```csharp
public static ForgeTypeId SlopeEndHeight { get; }
```